<template>
  <!-- Основной контент -->
  <v-main class="pt-12">
    <v-container>
      <v-card class="pa-4">
        <v-card-title class="align-center text-h4">
          История падающих блоков, ставших легендой
        </v-card-title>
        <v-card-text class="text-h6">
          В 1984 году в московском Вычислительном центре Академии наук СССР
          инженер Алексей Пажитнов создал нечто уникальное — игру, вдохновлённую
          головоломкой «Пентамино». Упростив идею до фигур из четырёх блоков —
          «тетрамино», он написал первую версию «Тетриса» на языке Паскаль для
          компьютера «Электроника-60». Без графики и звуков, но с невероятной
          увлекательностью, игра моментально захватила внимание коллег.
          <br />
          <br />
          «Тетрис» распространялся по СССР, а затем и за его пределы — через
          кассеты и дискеты. В годы перестройки игра попала в руки венгерского
          программиста Роберта Стайна и вскоре оказалась на Западе. Правами на
          неё заинтересовались такие гиганты, как Atari и Nintendo. В итоге
          победила Nintendo, выпустившая в 1989 году версию для Game Boy. Она
          стала культовой, позволив миллионам складывать блоки в любом месте —
          от поездов до школьных парт.
          <br />
          <br />
          «Тетрис» — больше чем игра. Это философия порядка, символ гармонии в
          хаосе. Он вдохновлял художников, учёных и даже помогал при ПТСР. В
          2023 году его играли на МКС, а значит — он побывал в космосе.
          <br />
          <br />
          Сегодня «Тетрис» — вечная классика. И каждый раз, когда исчезает
          линия, мы вспоминаем 1984-й — год рождения великой головоломки,
          объединившей мир.
        </v-card-text>
      </v-card>
    </v-container>
  </v-main>
</template>
